using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Ch3HW
{
    internal class Program
    {
        static void Main(string[] args)
        {

            //Ch3 for迴圈
            //1.ch.3例題3-1~3-7、習題3-1~3-7、補充習題1~3
            //例題3-1
            //讀入五個整數，求這五個整數的和。

            //例題3-2
            //求N個整數的和，N由使用者輸入。


            //例題3-3
            //假設有N個正整數，求其中的最大值。


            //例題3-4
            //假設有N個正整數，求最大奇數值。


            //例題3-5
            //求N階層，即求1×2×3×…×N。


            //例題3-6
            //輸出一個九九乘法表。


            //例題3-7
            //輸出一個九九乘法表，排列成三欄三列。

            //習題3-1
            //寫一程式，輸入10個整數，求其最小值。


            //習題3-2
            //寫一程式，輸入N個整數，求其最小值。


            //習題3-3
            //寫一程式，輸入10個整數，列出其中所有大於12的數字。

            //習題3-4
            //寫一程式，輸入10個整數，列出其中所有大於12的數字的總和。

            //習題3-5
            //寫一程式，輸入N個數字，求其所有奇數中的最大值。例如輸入11,12,3,24,15，答案是15。


            //習題3-6
            //寫一程式，輸入N個數字，求其所有正數之平方的加總。例如輸入1,-2,3,-4,5五個數字，得到 1^2  + 3^2 + 5^2 = 1 + 9 + 25 = 35


            //習題3-7
            //寫一程式，輸入N個數字，其中有些是負數，將這些負數轉換成正數，例如 - 7會被轉換成7。

            //補充習題1
            //判斷101-200之間有多少個質數，並輸出所有質數。


            //補充習題2
            //輸入一個數，輸出其質因數

            //補充習題3
            //求100到300中可以被3與7整除的個數。






            //Ch4 while迴圈
            //2.ch.3作業改為While寫法

            //例題3-1
            //讀入五個整數，求這五個整數的和。

            //例題3-2
            //求N個整數的和，N由使用者輸入。


            //例題3-3
            //假設有N個正整數，求其中的最大值。


            //例題3-4
            //假設有N個正整數，求最大奇數值。


            //例題3-5
            //求N階層，即求1×2×3×…×N。


            //例題3-6
            //輸出一個九九乘法表。


            //例題3-7
            //輸出一個九九乘法表，排列成三欄三列。

            //習題3-1
            //寫一程式，輸入10個整數，求其最小值。


            //習題3-2
            //寫一程式，輸入N個整數，求其最小值。


            //習題3-3
            //寫一程式，輸入10個整數，列出其中所有大於12的數字。

            //習題3-4
            //寫一程式，輸入10個整數，列出其中所有大於12的數字的總和。

            //習題3-5
            //寫一程式，輸入N個數字，求其所有奇數中的最大值。例如輸入11,12,3,24,15，答案是15。


            //習題3-6
            //寫一程式，輸入N個數字，求其所有正數之平方的加總。例如輸入1,-2,3,-4,5五個數字，得到 1^2  + 3^2 + 5^2 = 1 + 9 + 25 = 35


            //習題3-7
            //寫一程式，輸入N個數字，其中有些是負數，將這些負數轉換成正數，例如 - 7會被轉換成7。

            //補充習題1
            //判斷101-200之間有多少個質數，並輸出所有質數。


            //補充習題2
            //輸入一個數，輸出其質因數

            //補充習題3
            //求100到300中可以被3與7整除的個數。


            //Ch4 while迴圈
            //3.ch.4例題4-1~4-3、習題4-1~4-5、補充習題1~3
            //(如果題目文字與流程圖不一樣，以文字為主)
            //(如果題目題意不清楚，請隨時發問)


            //例題4-1
            //讀入一連串的數字，但事先不知道數字的數目。



            //例題4-2
            //求最大公約數(Greatest Common Divisor，簡寫G.C.D.，或稱最大公因數)。



            //例題4-3
            //計算N個數字的和。



            //習題4-1
            //利用while寫一程式求N個數字的最大值。



            //習題4-2
            //利用while寫一程式求一個等差級數數字的和，一共有N個數字，程式應該輸入最小的起始值以及數字間的差。(即從起始值開始，間格差，共N個 的總和)



            //習題4-3
            //利用while寫一程式，讀入N個數字，然後找出所有小於13的數，再求這些數字的和。

            //習題4-4
            //利用while寫一程式，讀入N個數字，找到第一個大於7而小於10的數字就停止，而且列印出這個數字。


            //習題4-5
            //利用while寫一程式，讀入a1,a2,…,a5和b1,b2,…,b5。找到第一個ai>bi，即停止，並列印出ai及bi。

            //補充習題1
            //Eric覺得麥蒂勞的39元漢堡實在太便宜、太好吃了，因此他決定晚餐要把口袋裡所有錢通通拿來吃39元漢堡。假設他每5分鐘就能吃一個漢堡，請隨意輸入一個時間，輸出這段時間吃漢堡的紀錄。


            //補充習題2
            //小明貸款買房花560萬，每個月可還4萬，每還12個月，因為年終獎金可以多還一萬，請問需要幾個月還清。

            //補充習題3
            //系統隨機產生一個數字，讓使用者數入數字，直到猜中才離開程式！，猜錯時，要提示是比較大還是比較小。






            //Bonus1：P.34附圖的依據輸入客製化的聖誕樹

            //Bonus2：用遞迴(Recursion)方式寫出費波那契數列：輸入整數N，輸出fibonacci(N)[費氏數列的第N個數]
            //因超過範圍，刪除bonus2.。
            //(要用函數function(又稱方法method)來做)






        }
    }
}
